Revit 2024 API
ConduitSizes.GetConduitSizesIterator Method
 Returns a ConduitSizeIterator to the conduit sizes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ConduitSizeIterator GetConduitSizesIterator()
Visual Basic
Public Function GetConduitSizesIterator As ConduitSizeIterator
Visual C++
public:
ConduitSizeIterator^ GetConduitSizesIterator()
See Also
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace